<a href="https://colab.research.google.com/github/Kevoen/Google_Colab_Rep/blob/master/%E7%AC%AC%E4%B8%80%E7%AB%A0%EF%BC%9A%E7%AC%AC%E4%BA%8C%E8%8A%82pandas%E5%9F%BA%E7%A1%80_%E8%AF%BE%E7%A8%8B.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## 0. ÈìæÊé•‰∏éÊåÇËΩΩGoogle Drive

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly&response_type=code

Enter your authorization code:
¬∑¬∑¬∑¬∑¬∑¬∑¬∑¬∑¬∑¬∑
Mounted at /content/drive

In [2]:
!ln -s /content/drive/My\ Drive/ /mydrive
!ls /mydrive

ls: cannot access 'mydrive': No such file or directory

In [3]:
%cd /mydrive/Colab_Notebooks/DataWhela/Data Analysis/hands-on-data-analysis/Á¨¨‰∏ÄÂçïÂÖÉÈ°πÁõÆÈõÜÂêà

/content/drive/My Drive/Colab_Notebooks/DataWhela/Data Analysis/hands-on-data-analysis/Á¨¨‰∏ÄÂçïÂÖÉÈ°πÁõÆÈõÜÂêà

**Â§ç‰π†Ôºö**Êï∞ÊçÆÂàÜÊûêÁöÑÁ¨¨‰∏ÄÊ≠•ÔºåÂä†ËΩΩÊï∞ÊçÆÊàë‰ª¨Â∑≤ÁªèÂ≠¶‰π†ÂÆåÊØï‰∫Ü„ÄÇÂΩìÊï∞ÊçÆÂ±ïÁé∞Âú®Êàë‰ª¨Èù¢ÂâçÁöÑÊó∂ÂÄôÔºåÊàë‰ª¨ÊâÄË¶ÅÂÅöÁöÑÁ¨¨‰∏ÄÊ≠•Â∞±ÊòØËÆ§ËØÜ‰ªñÔºå‰ªäÂ§©Êàë‰ª¨Ë¶ÅÂ≠¶‰π†ÁöÑÂ∞±ÊòØ**‰∫ÜËß£Â≠óÊÆµÂê´‰πâ‰ª•ÂèäÂàùÊ≠•ËßÇÂØüÊï∞ÊçÆ**„ÄÇ

## 1 Á¨¨‰∏ÄÁ´†ÔºöÊï∞ÊçÆËΩΩÂÖ•ÂèäÂàùÊ≠•ËßÇÂØü

### 1.4 Áü•ÈÅì‰Ω†ÁöÑÊï∞ÊçÆÂè´‰ªÄ‰πà
Êàë‰ª¨Â≠¶‰π†pandasÁöÑÂü∫Á°ÄÊìç‰ΩúÔºåÈÇ£‰πà‰∏ä‰∏ÄËäÇÈÄöËøápandasÂä†ËΩΩ‰πãÂêéÁöÑÊï∞ÊçÆÔºåÂÖ∂Êï∞ÊçÆÁ±ªÂûãÊòØ‰ªÄ‰πàÂë¢Ôºü

**ÂºÄÂßãÂâçÂØºÂÖ•numpyÂíåpandas**

In [5]:
import numpy as np
import pandas as pd

#### 1.4.1 ‰ªªÂä°‰∏ÄÔºöpandas‰∏≠Êúâ‰∏§‰∏™Êï∞ÊçÆÁ±ªÂûãDateFrameÂíåSeriesÔºåÈÄöËøáÊü•ÊâæÁÆÄÂçï‰∫ÜËß£‰ªñ‰ª¨„ÄÇÁÑ∂ÂêéËá™Â∑±ÂÜô‰∏Ä‰∏™ÂÖ≥‰∫éËøô‰∏§‰∏™Êï∞ÊçÆÁ±ªÂûãÁöÑÂ∞è‰æãÂ≠êüå∞[ÂºÄÊîæÈ¢ò]

- Series ÊòØÂ∏¶Ê†áÁ≠æÁöÑ‰∏ÄÁª¥Êï∞ÁªÑÔºåÂèØÂ≠òÂÇ®Êï¥Êï∞„ÄÅÊµÆÁÇπÊï∞„ÄÅÂ≠óÁ¨¶‰∏≤„ÄÅPython ÂØπË±°Á≠âÁ±ªÂûãÁöÑÊï∞ÊçÆ„ÄÇËΩ¥Ê†áÁ≠æÁªüÁß∞‰∏∫Á¥¢Âºï„ÄÇ

In [7]:
#ÂÜôÂÖ•‰ª£Á†Å
s = pd.Series(np.random.randn(4),index=['a','b','c','d'])
s

0   -0.925946
1   -0.377677
2    1.079876
3   -0.771658
dtype: float64

In [8]:
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [9]:
pd.Series(np.random.randn(4))

0   -0.191280
1   -1.958319
2    0.223907
3   -0.341268
dtype: float64

In [10]:
d = {'b': 1, 'a': 0, 'c': 2}
pd.Series(d)

b    1
a    0
c    2
dtype: int64

- DataFrame ÊòØÁî±Â§öÁßçÁ±ªÂûãÁöÑÂàóÊûÑÊàêÁöÑ‰∫åÁª¥Ê†áÁ≠æÊï∞ÊçÆÁªìÊûÑ

In [11]:
d = {'one': [1., 2., 3., 4.],'two': [4., 3., 2., 1.]}
pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [12]:
 d = {'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']), 'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}
 pd.DataFrame(d)

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

#### 1.4.2 ‰ªªÂä°‰∫åÔºöÊ†πÊçÆ‰∏äËäÇËØæÁöÑÊñπÊ≥ïËΩΩÂÖ•"train.csv"Êñá‰ª∂

In [14]:
#ÂÜôÂÖ•‰ª£Á†Å
df = pd.read_csv('train.csv')
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

‰πüÂèØ‰ª•Âä†ËΩΩ‰∏ä‰∏ÄËäÇËØæ‰øùÂ≠òÁöÑ"train_chinese.csv"Êñá‰ª∂„ÄÇÈÄöËøáÁøªËØëÁâàtrain_chinese.csvÁÜüÊÇâ‰∫ÜËøô‰∏™Êï∞ÊçÆÈõÜÔºåÁÑ∂ÂêéÊàë‰ª¨ÂØπtrian.csvÊù•ËøõË°åÊìç‰Ωú
#### 1.4.3 ‰ªªÂä°‰∏âÔºöÊü•ÁúãDataFrameÊï∞ÊçÆÁöÑÊØèÂàóÁöÑÈ°π

In [15]:
#ÂÜôÂÖ•‰ª£Á†Å
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

#### 1.4.4‰ªªÂä°ÂõõÔºöÊü•Áúã"cabin"ËøôÂàóÁöÑÊâÄÊúâÈ°π [ÊúâÂ§öÁßçÊñπÊ≥ï]

In [21]:
#ÂÜôÂÖ•‰ª£Á†Å
df['Cabin'].head()

0     NaN
1     C85
2     NaN
3    C123
4     NaN
Name: Cabin, dtype: object

In [22]:
#ÂÜôÂÖ•‰ª£Á†Å
df.Cabin.head()

0     NaN
1     C85
2     NaN
3    C123
4     NaN
Name: Cabin, dtype: object

#### 1.4.5 ‰ªªÂä°‰∫îÔºöÂä†ËΩΩÊñá‰ª∂"test_1.csv"ÔºåÁÑ∂ÂêéÂØπÊØî"train.csv"ÔºåÁúãÁúãÊúâÂì™‰∫õÂ§öÂá∫ÁöÑÂàóÔºåÁÑ∂ÂêéÂ∞ÜÂ§öÂá∫ÁöÑÂàóÂà†Èô§
ÁªèËøáÊàë‰ª¨ÁöÑËßÇÂØüÂèëÁé∞‰∏Ä‰∏™ÊµãËØïÈõÜtest_1.csvÊúâ‰∏ÄÂàóÊòØÂ§ö‰ΩôÁöÑÔºåÊàë‰ª¨ÈúÄË¶ÅÂ∞ÜËøô‰∏™Â§ö‰ΩôÁöÑÂàóÂà†Âéª

In [24]:
#ÂÜôÂÖ•‰ª£Á†Å
test_1 = pd.read_csv('test_1.csv')
test_1.head()

   Unnamed: 0  PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked    a
0           0            1         0       3  ...   7.2500   NaN         S  100
1           1            2         1       1  ...  71.2833   C85         C  100
2           2            3         1       3  ...   7.9250   NaN         S  100
3           3            4         1       1  ...  53.1000  C123         S  100
4           4            5         0       3  ...   8.0500   NaN         S  100

[5 rows x 14 columns]

In [25]:
#ÂÜôÂÖ•‰ª£Á†Å
del test_1['a']
test_1.head()

   Unnamed: 0  PassengerId  Survived  ...     Fare Cabin Embarked
0           0            1         0  ...   7.2500   NaN        S
1           1            2         1  ...  71.2833   C85        C
2           2            3         1  ...   7.9250   NaN        S
3           3            4         1  ...  53.1000  C123        S
4           4            5         0  ...   8.0500   NaN        S

[5 rows x 13 columns]

„ÄêÊÄùËÄÉ„ÄëËøòÊúâÂÖ∂‰ªñÁöÑÂà†Èô§Â§ö‰ΩôÁöÑÂàóÁöÑÊñπÂºèÂêóÔºü

In [35]:
# ÊÄùËÄÉÂõûÁ≠î
test_1 = pd.read_csv('test_1.csv')

test_1.pop('a')
test_1.head()

   Unnamed: 0  PassengerId  Survived  ...     Fare Cabin Embarked
0           0            1         0  ...   7.2500   NaN        S
1           1            2         1  ...  71.2833   C85        C
2           2            3         1  ...   7.9250   NaN        S
3           3            4         1  ...  53.1000  C123        S
4           4            5         0  ...   8.0500   NaN        S

[5 rows x 13 columns]

In [37]:
test_1 = pd.read_csv('test_1.csv')
test_1.drop(['a'],axis=1,inplace=True)
test_1.head()

   Unnamed: 0  PassengerId  Survived  ...     Fare Cabin Embarked
0           0            1         0  ...   7.2500   NaN        S
1           1            2         1  ...  71.2833   C85        C
2           2            3         1  ...   7.9250   NaN        S
3           3            4         1  ...  53.1000  C123        S
4           4            5         0  ...   8.0500   NaN        S

[5 rows x 13 columns]

In [34]:
# Ëá™Âä®Âà†Èô§
test_1 = pd.read_csv('test_1.csv')
df = pd.read_csv('train.csv')
df_col = df.columns
test_col = test_1.columns
for __,index in enumerate(test_col):
  flag = False
  for df_ind in df_col:
    if df_ind == index:
      flag = True
  if flag == False:
    del test_1[index]
    print("delete",index)

test_1.head()

delete Unnamed: 0
delete a

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

#### 1.4.6 ‰ªªÂä°ÂÖ≠Ôºö Â∞Ü['PassengerId','Name','Age','Ticket']ËøôÂá†‰∏™ÂàóÂÖÉÁ¥†ÈöêËóèÔºåÂè™ËßÇÂØüÂÖ∂‰ªñÂá†‰∏™ÂàóÂÖÉÁ¥†

In [39]:
#ÂÜôÂÖ•‰ª£Á†Å

df.drop(['PassengerId','Name','Age','Ticket'],axis=1).head(3)

   Survived  Pclass     Sex  SibSp  Parch     Fare Cabin Embarked
0         0       3    male      1      0   7.2500   NaN        S
1         1       1  female      1      0  71.2833   C85        C
2         1       3  female      0      0   7.9250   NaN        S

„ÄêÊÄùËÄÉ„ÄëÂØπÊØî‰ªªÂä°‰∫îÂíå‰ªªÂä°ÂÖ≠ÔºåÊòØ‰∏çÊòØ‰ΩøÁî®‰∫Ü‰∏ç‰∏ÄÊ†∑ÁöÑÊñπÊ≥ï(ÂáΩÊï∞)ÔºåÂ¶ÇÊûú‰ΩøÁî®‰∏ÄÊ†∑ÁöÑÂáΩÊï∞Â¶Ç‰ΩïÂÆåÊàê‰∏äÈù¢ÁöÑ‰∏çÂêåÁöÑË¶ÅÊ±ÇÂë¢Ôºü

„ÄêÊÄùËÄÉÂõûÁ≠î„Äë

Â¶ÇÊûúÊÉ≥Ë¶ÅÂÆåÂÖ®ÁöÑÂà†Èô§‰Ω†ÁöÑÊï∞ÊçÆÁªìÊûÑÔºå‰ΩøÁî®inplace=TrueÔºåÂõ†‰∏∫‰ΩøÁî®inplaceÂ∞±Â∞ÜÂéüÊï∞ÊçÆË¶ÜÁõñ‰∫ÜÔºåÊâÄ‰ª•ËøôÈáåÊ≤°ÊúâÁî®

### 1.5 Á≠õÈÄâÁöÑÈÄªËæë

Ë°®Ê†ºÊï∞ÊçÆ‰∏≠ÔºåÊúÄÈáçË¶ÅÁöÑ‰∏Ä‰∏™ÂäüËÉΩÂ∞±ÊòØË¶ÅÂÖ∑ÊúâÂèØÁ≠õÈÄâÁöÑËÉΩÂäõÔºåÈÄâÂá∫ÊàëÊâÄÈúÄË¶ÅÁöÑ‰ø°ÊÅØÔºå‰∏¢ÂºÉÊó†Áî®ÁöÑ‰ø°ÊÅØ„ÄÇ

‰∏ãÈù¢Êàë‰ª¨ËøòÊòØÁî®ÂÆûÊàòÊù•Â≠¶‰π†pandasËøô‰∏™ÂäüËÉΩ„ÄÇ

#### 1.5.1 ‰ªªÂä°‰∏ÄÔºö Êàë‰ª¨‰ª•"Age"‰∏∫Á≠õÈÄâÊù°‰ª∂ÔºåÊòæÁ§∫Âπ¥ÈæÑÂú®10Â≤Å‰ª•‰∏ãÁöÑ‰πòÂÆ¢‰ø°ÊÅØ„ÄÇ

In [41]:
#ÂÜôÂÖ•‰ª£Á†Å
df[df.Age<10].head(3)

    PassengerId  Survived  Pclass  ...    Fare Cabin  Embarked
7             8         0       3  ...  21.075   NaN         S
10           11         1       3  ...  16.700    G6         S
16           17         0       3  ...  29.125   NaN         Q

[3 rows x 12 columns]

#### 1.5.2 ‰ªªÂä°‰∫åÔºö ‰ª•"Age"‰∏∫Êù°‰ª∂ÔºåÂ∞ÜÂπ¥ÈæÑÂú®10Â≤Å‰ª•‰∏äÂíå50Â≤Å‰ª•‰∏ãÁöÑ‰πòÂÆ¢‰ø°ÊÅØÊòæÁ§∫Âá∫Êù•ÔºåÂπ∂Â∞ÜËøô‰∏™Êï∞ÊçÆÂëΩÂêç‰∏∫midage

In [42]:
#ÂÜôÂÖ•‰ª£Á†Å
df[(df.Age>10)&(df.Age<50)].head(3)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S

[3 rows x 12 columns]

„ÄêÊèêÁ§∫„Äë‰∫ÜËß£pandasÁöÑÊù°‰ª∂Á≠õÈÄâÊñπÂºè‰ª•ÂèäÂ¶Ç‰Ωï‰ΩøÁî®‰∫§ÈõÜÂíåÂπ∂ÈõÜÊìç‰Ωú

#### 1.5.3 ‰ªªÂä°‰∏âÔºöÂ∞ÜmidageÁöÑÊï∞ÊçÆ‰∏≠Á¨¨100Ë°åÁöÑ"Pclass"Âíå"Sex"ÁöÑÊï∞ÊçÆÊòæÁ§∫Âá∫Êù•

In [44]:
#ÂÜôÂÖ•‰ª£Á†Å
# midage = df.reset_index(drop=True)
df.loc[[100],['Pclass','Sex']]

     Pclass     Sex
100       3  female

„ÄêÊÄùËÄÉ„ÄëËøô‰∏™reset_index()ÂáΩÊï∞ÁöÑ‰ΩúÁî®ÊòØ‰ªÄ‰πàÔºüÂ¶ÇÊûú‰∏çÁî®Ëøô‰∏™ÂáΩÊï∞Ôºå‰∏ãÈù¢ÁöÑ‰ªªÂä°‰ºöÂá∫Áé∞‰ªÄ‰πàÊÉÖÂÜµÔºü

#### 1.5.4 ‰ªªÂä°ÂõõÔºöÂ∞ÜmidageÁöÑÊï∞ÊçÆ‰∏≠Á¨¨100Ôºå105Ôºå108Ë°åÁöÑ"Pclass"Ôºå"Name"Âíå"Sex"ÁöÑÊï∞ÊçÆÊòæÁ§∫Âá∫Êù•

In [47]:
#ÂÜôÂÖ•‰ª£Á†Å
df.loc[[100,105,108],['Pclass','Name','Sex']]

     Pclass                     Name     Sex
100       3  Petranec, Miss. Matilda  female
105       3    Mionoff, Mr. Stoytcho    male
108       3          Rekic, Mr. Tido    male

„ÄêÊèêÁ§∫„Äë‰ΩøÁî®pandasÊèêÂá∫ÁöÑÁÆÄÂçïÊñπÂºèÔºå‰Ω†ÂèØ‰ª•ÁúãÁúãlocÊñπÊ≥ï

ÂØπÊØîÊï¥‰ΩìÁöÑÊï∞ÊçÆ‰ΩçÁΩÆÔºå‰Ω†ÊúâÂèëÁé∞‰ªÄ‰πàÈóÆÈ¢òÂêóÔºüÈÇ£‰πàÂ¶Ç‰ΩïËß£ÂÜ≥Ôºü

#### 1.5.5 ‰ªªÂä°‰∫îÔºö‰ΩøÁî®ilocÊñπÊ≥ïÂ∞ÜmidageÁöÑÊï∞ÊçÆ‰∏≠Á¨¨100Ôºå105Ôºå108Ë°åÁöÑ"Pclass"Ôºå"Name"Âíå"Sex"ÁöÑÊï∞ÊçÆÊòæÁ§∫Âá∫Êù•

In [49]:
#ÂÜôÂÖ•‰ª£Á†Å
df.iloc[[100,105,108],[2,3,4]]

     Pclass                     Name     Sex
100       3  Petranec, Miss. Matilda  female
105       3    Mionoff, Mr. Stoytcho    male
108       3          Rekic, Mr. Tido    male